Revit 2026 API

# ExportPatternTableIterator Methods

---

The ExportPatternTableIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsDone | Identifies if the iteration has completed. |
|  | MoveNext | Increments the iterator to the next item. |
|  | Reset | Resets the iterator to the initial state. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

ExportPatternTableIterator Class

Autodesk.Revit.DB Namespace